R1 >>>> Router Configuration
R1#config t
R1(config)#int f0/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#int s1/0
R1(config-if)#ip address 10.0.0.1 255.255.255.252
R1(config-if)#clock rate 64000
R1(config-if)#no shut
R1(config-if)#exit

R2 >>>> Router configuration
R2(config)#int f0/0
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#no shut
R2(config-if)#exit
R2(config)#int s1/0
R2(config-if)#ip address 10.0.0.2 255.255.255.252
R2(config-if)#no shut
R2(config-if)#exit

Static Routing on Routers
R1 >>>>
R1(config)#ip route 192.168.2.0 255.255.255.0 10.0.0.2
R1(config)#do sh ip route
R2 >>>>
R2(config)#ip route 192.168.1.0 255.255.255.0 10.0.0.1
R2(config)#do sh ip route

Manually set an IP on PC1
PC1> ip 192.168.1.10 255.255.255.0 192.168.1.1
Manually set an IP on PC2
PC2> ip 192.168.2.10 255.255.255.0 192.168.2.1


Ping Command form PC1 towards R1, R2, PC2
ping 192.168.1.1
ping 192.168.2.1
ping 192.168.2.10

Ping Command form PC2 towards R1, R2, PC1
ping 192.168.2.1
ping 192.168.1.1
ping 192.168.1.10

