Configure the IPv4 address on the physical interface on the routers:
R1 >>>> IP and Network Configuration
R1#enable
R1#config t
R1(config)#int f0/0
R1(config-if)#ip address 10.1.1.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#exit

R2 >>>> IP and Network Configuration
R2#enable
R2#config t
R2(config)#int f0/0
R2(config-if)#ip address 10.1.1.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#int f0/1
R2(config-if)#ip address 20.1.1.1 255.255.255.0
R2(config-if)#no shut
R2(config-if)#exit

R3 >>>> IP and Network Configuration
R3#enable
R3#config t
R3(config)#int f0/1
R3(config-if)#ip address 20.1.1.2 255.255.255.0
R3(config-if)#no shut
R3(config-if)#exit

Configure a loopback interface on R1 with an IPv4 address:
R1(config)#int loopback 0
R1(config-if)#ip address 1.1.1.1 255.255.255.255
R1(config-if)#no shut

Configuring the OSPF process on all three routers with the command router OSPF <process-id>:
R1(config)#router ospf 1
R1(config-router)#exit
R2(config)#router ospf 1
R2(config-router)#exit
R3(config)#router ospf 1
R3(config-router)#exit

Enabling OSPF on the interfaces with the interface level sub-command IP OSPF <process-id>
area <area-id> :
R1(config)#int loopback 0
R1(config-if)#ip ospf 1 area 0
R1(config-if)#int f0/0
R1(config-if)#ip ospf 1 area 0
R1(config-if)#no shut

R2(config)#int f0/0
R2(config-if)#ip ospf 1 area 0
R2(config-if)#no shut

R3(config)#int f0/1
R3(config-if)#ip ospf 1 area 1
R3(config-if)#no shut

Configuring area 2 as a stub area with the router sub-command area <area-id> stub
R2(config)#router ospf 1
R2(config-router)#area 1 stub
R2(config-router)#exit

R3(config-router)#area 1 stub
R3(config-router)#exit

Verifying OSPF configuration on the routers:
R1(config)#do show ip protocol
R2(config)#do show ip protocol
R3(config)#do show ip protocol

Checking the IPv4 routing table on the routers and seeing OSPF route entry:
R1(config)#do show ip route
R2(config)#do show ip route
R3(config)#do show ip route
